{
    "mentioned_cpes": ["Cisco IOS"],
    "issue_name": "People's Republic of China-Linked Cyber Actors Hide in Router Firmware",
    "steps_to_fix": {
        "1": {
            "command": "Disable outbound connections",
            "description": "Apply the 'transport output none' configuration command to the virtual teletype (VTY) lines to prevent some copy commands from successfully connecting to external systems."
        },
        "2": {
            "command": "Monitor inbound and outbound connections",
            "description": "Monitor both inbound and outbound connections from network devices to both external and internal systems. Block unauthorized outbound connections by applying access lists or rule sets to other nearby network devices."
        },
        "3": {
            "command": "Limit access to administration services",
            "description": "Only permit IP addresses used by network administrators by applying access lists to the VTY lines or specific services. Monitor logs for successful and unsuccessful login attempts."
        },
        "4": {
            "command": "Upgrade devices",
            "description": "Upgrade devices to ones that have secure boot capabilities with better integrity and authenticity checks for bootloaders and firmware. Prioritize replacing all end-of-life and unsupported equipment."
        },
        "5": {
            "command": "Change all passwords and keys",
            "description": "When there is a concern that a single password has been compromised, change all passwords and keys."
        },
        "6": {
            "command": "Review logs",
            "description": "Review logs generated by network devices and monitor for unauthorized reboots, operating system version changes, changes to the configuration, or attempts to update the firmware."
        },
        "7": {
            "command": "Perform file and memory verification",
            "description": "Periodically perform both file and memory verification to detect unauthorized changes to the software stored and running on network devices."
        },
        "8": {
            "command": "Monitor for changes to firmware",
            "description": "Periodically take snapshots of boot records and firmware and compare against known good images."
        }
    },
    "paths": {
        "1": [1, 2, 3, 4, 5, 6, 7, 8]
    }
}